// © Copyright 2012-2013, 2015-2016 HP Development Company, L.P.

// Task name & description
HSDTaskName = "Proxy-Server - Einstellungen";
HSDTaskDescription = "Der Drucker lässt sich mit dem Internet verbinden. Wenn die Verbindung zum Internet über einen Proxy-Server erfolgt, konfigurieren Sie die Einstellungen weiter unten.";
TaskDescriptionInAssistantMode = "Damit eine Verbindung zu den HP Webdiensten hergestellt werden kann, muss der Drucker mit dem Internet verbunden sein. Wenn Sie für die Verbindung zum Internet einen Proxy-Server verwenden, geben Sie u. g. Einstellungen ein.\n\nKennen Sie die Proxy-Einstellungen nicht, verwenden Sie die Einstellungen im Fenster mit den Netzwerkeinstellungen, oder wenden Sie sich an den Systemadministrator.";

// Radio buttons matrix
HSDProxyServerNotRequiredTitle = "Zum Verbinden mit dem Internet ist kein Proxy-Server erforderlich";
HSDAutomaticProxySettingsTitle = "Automatisch (die Einstellungen werden automatisch vom Gerät erkannt)";
HSDCustomProxySettingsTitle = "Benutzerdefinierte Proxy-Serverkonfiguration:";
HSDSystemProxySettingsTitle = "Systemeinstellungen kopieren";

// Proxy server settings
HSDProxyServerTitle = "Proxy-Server:";
ProxyPortTitle = "Proxy-Port:";

// Authentication
HSDRequiresAuthenticationButton = "Proxy-Server erfordert Authentifizierung";
HSDUserNameTitle = "Benutzername:";
HSDPasswordTitle = "Kennwort:";

HSDApplyNowButtonTitle = "Jetzt anwenden";

// progress titles
UpdateInformationProcessTitle = "Informationen aktualisieren...";

// alerts
EmptyProxyServerOrPortErrorText = "Proxy-Server und Proxy-Port müssen beide angegeben werden.";

EmptyUserNameOrPasswordErrorText = "Für Proxy-Server-Authentifizierung müssen Benutzername und Kennwort angegeben werden.";

IncorrectProxyServerNameFormatErrorText = "Fehler beim Festlegen des Proxy-Server-Namens. Überprüfen Sie, ob das Format gültig ist.";

HSDUserNameTooLargeErrorText = "Der Benutzername ist zu lang. Ihr Gerät unterstützt Benutzernamen mit maximal %d Zeichen.";
